////////////////////////////////////////
// ค่าเซอร์โว หาค่าเซอร์โวที่ฟังก์ชั่น 0
// และอ่านค่าที่หน้าจอ นำมากรอกในบรรทัดที่ 8,9
////////////////////////////////////////
// เก็บสี่เหลี่ยม ต้องให้ลูกบาศก์อยู่ในตัวแม็กกาซีน และตกลงไปล่างสุดของแม็กกาซีน
int s1 = 153; // ค่าเก็บ
// ปล่อยลูกสี่เหลี่ยม ต้องให้ลูกบาศก์ตกออกจากตัวหุ่นยนต์ ลงพื้น
int s2 = 95; // ค่าปล่อย
////////////////////////////////////////
// ค่าแสง หาค่าโดยการอ่านสีขาว,ดำ ที่ฟังก์ชั่น 1
// เมื่อจดบันทึกเซนเซอร์ครบ 5 ตัว 2 สี (ขาว,ดำ)
// นำมาบวกกันหารสอง หรือ (ขาว+ดำ) % 2
////////////////////////////////////////
#define ref0  400  //ค่าแสง หน้า ซ้าย
#define ref1  400  //ค่าแสง หน้า กลาง
#define ref2  350  //ค่าแสง หน้า ขวา
#define ref3  400  //ค่าแสง หลัง ซ้าย
#define ref7  400  //ค่าแสง หลัง ขวา
////////////////////////////////////////
// จูนมอเตอร์ให้ตรง
// กรณีหุ่นยนต์วิ่งเอียงไปทางซ้าย ให้ลดกำลังมอเตอร์ ด้านขวา
// กรณีหุ่นยนต์วิ่งเอียงไปทางขวา ให้ลดกำลังมอเตอร์ ด้านซ้าย
////////////////////////////////////////
#define Fl  90  //กำลังมอเตอร์ วิ่งเร็ว ซ้าย
#define Fr  89  //กำลังมอเตอร์ วิ่งเร็ว ขวา

#define Fsl  70  //กำลังมอเตอร์ วิ่งช้า ซ้าย
#define Fsr  69  //กำลังมอเตอร์ วิ่งช้า ขวา

#define Tl  60  //กำลังมอเตอร์ เลี้ยว ล้อซ้าย
#define Tr  59  //กำลังมอเตอร์ เลี้ยว ล้อขวา

#define pause_time 100 // เวลาในการหยุด แต่ละจุด
///////////////////////////////
// ฟังก์ชั่นตั้งแต่ 2 เป็นต้นไป คือฟังก์ชั่นในการวิ่ง
void Pattern(){
  //เขียนโปรแกรมตรงนี้

  R(80, 320); // เดินตรงขึ้นไป 90 เซนติเมตร และทำการเลี้ยว 530
  R(50, 320);
  R(20, 320);
  L(20, 320);
  Out(40);
  Bk_En(22);
  Turn_L(320);
  Check_B();
  F_Track_En(73);
  Turn_R(320);
  Check_B();
  R(20, 320);
  Out(10);
  Check_B();
  Fw_Slow_En(10);
  Turn_R(320);
  Check_B();
  R(20, 320);
  R(50, 320);
  R(20, 320);
  Out(10);
  Check_B();
  Fw_Slow_En(10);
  Turn_R(320);
  Check_B();
  F_Track_En(70);
  Turn_R(320);
  L(20, 320);
  Out(10);
  Bk_En(10);
  Turn_R(580);
  Check_B();
  Out(80);

  Bk_En(55);
  Turn_R(320);
  Check_B();
  L(50, 320);
  F_Track_En(27);
  Turn_R(320);
  Check_B();
  R(120, 320);
  R(20, 320);
  L(20, 320);
  L(20, 320);
  L(50, 320);
  Check_B();
  F_Track_En(100);


  /////////////////
}
